02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette_LowRe/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
6.58063
6.58063
6.58063
6.58063
6.58063
6.58063
6.58063
6.58063
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    cyc_half0
    {
        type            cyclic;
    }
    cyc_half1
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
