02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette_LowRe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.05;
    }

    "(U|sigma)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }
    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
    pFinal
    {
        $p;
        relTol          0;
    }

}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    pRefCell 0;
    pRefValue 0;
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|epsilon|omega|f|v2)" 1e-4;
    }
   

}

relaxationFactors
{
    equations
    {
        ".*"   0.8;
    }
}

// ************************************************************************* //
